#!/usr/bin/env python
# coding: utf-8

# In[ ]:


# 110
if True:             # 만약 조건문이 참이라면ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅣ
    if False:        # 만약 조건문이 거짓이라면ㅡㅡㅡㅡㅡㅡㅡㅡㅣ   ㅣ
        print("1")    # 1을 출력해라 (x)                       ㅣ   ㅣ
        print("2")    # 2를 출력해라 (x)                      ㅣ   ㅣ
    else:             # 조건문이 거짓이 아닌 참이라면 <ㅡㅡㅡㅣ   ㅣ
        print("3")    # 3을 출력해라 (o)                          ㅣ
else:                 # 조건문이 참이 아닌 거짓이라면 <ㅡㅡㅡㅡㅡㅣ
    print("4")        # 4를 출력해라 (x)
print("5")            # 5를 출력해라

